Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_adc1.h
/*
 * SPDX-License-Identifier: MIT
 *
 * Goal:     stm32V873_adc1 equates.
 */
#pragma once

#include    <stdint.h>

// ADC1 address definitions
// ------------------------

typedef struct {
    volatile    uint32_t    ISR;
    volatile    uint32_t    IER;
    volatile    uint32_t    CR;
    volatile    uint32_t    CFGR1;
    volatile    uint32_t    CFGR2;
    volatile    uint32_t    SMPR1;
    volatile    uint32_t    SMPR2;
    volatile    uint32_t    PCSEL;
    volatile    uint32_t    RESERVED0[4];
    volatile    uint32_t    SQR1;
    volatile    uint32_t    SQR2;
    volatile    uint32_t    SQR3;
    volatile    uint32_t    SQR4;
    volatile    uint32_t    DR;
    volatile    uint32_t    RESERVED1[2];
    volatile    uint32_t    JSQR;
    volatile    uint32_t    OFCFGR1;
    volatile    uint32_t    OFCFGR2;
    volatile    uint32_t    OFCFGR3;
    volatile    uint32_t    OFCFGR4;
    volatile    uint32_t    OFR1;
    volatile    uint32_t    OFR2;
    volatile    uint32_t    OFR3;
    volatile    uint32_t    OFR4;
    volatile    uint32_t    GCOMP;
    volatile    uint32_t    RESERVED2[3];
    volatile    uint32_t    JDR1;
    volatile    uint32_t    JDR2;
    volatile    uint32_t    JDR3;
    volatile    uint32_t    JDR4;
    volatile    uint32_t    RESERVED3[4];
    volatile    uint32_t    AWD2CR;
    volatile    uint32_t    AWD3CR;
    volatile    uint32_t    AWD1LTR;
    volatile    uint32_t    AWD1HTR;
    volatile    uint32_t    AWD2LTR;
    volatile    uint32_t    AWD2HTR;
    volatile    uint32_t    AWD3LTR;
    volatile    uint32_t    AWD3HTR;
    volatile    uint32_t    DIFSEL;
    volatile    uint32_t    CALFACT;
    volatile    uint32_t    RESERVED4[2];
    volatile    uint32_t    OR;
} ADC1_TypeDef;

#if (defined(__cplusplus))
#define ADC1_S  reinterpret_cast<ADC1_TypeDef *>(0x50022000u)

#else
#define ADC1_S  ((ADC1_TypeDef *)0x50022000u)
#endif

// ISR Configuration

#define ADC1_ISR_LDORDY                     (0x1u<<12)
#define ADC1_ISR_JQOVF                      (0x1u<<10)
#define ADC1_ISR_AWD3                       (0x1u<<9)
#define ADC1_ISR_AWD2                       (0x1u<<8)
#define ADC1_ISR_AWD1                       (0x1u<<7)
#define ADC1_ISR_JEOS                       (0x1u<<6)
#define ADC1_ISR_JEOC                       (0x1u<<5)
#define ADC1_ISR_OVR                        (0x1u<<4)
#define ADC1_ISR_EOS                        (0x1u<<3)
#define ADC1_ISR_EOC                        (0x1u<<2)
#define ADC1_ISR_EOSMP                      (0x1u<<1)
#define ADC1_ISR_ADRDY                      (0x1u<<0)

#define ADC1_ISR_LDORDY_B_0X0               (0x0u<<12)
#define ADC1_ISR_LDORDY_B_0X1               (0x1u<<12)
#define ADC1_ISR_JQOVF_B_0X0                (0x0u<<10)
#define ADC1_ISR_JQOVF_B_0X1                (0x1u<<10)
#define ADC1_ISR_AWD3_B_0X0                 (0x0u<<9)
#define ADC1_ISR_AWD3_B_0X1                 (0x1u<<9)
#define ADC1_ISR_AWD2_B_0X0                 (0x0u<<8)
#define ADC1_ISR_AWD2_B_0X1                 (0x1u<<8)
#define ADC1_ISR_AWD1_B_0X0                 (0x0u<<7)
#define ADC1_ISR_AWD1_B_0X1                 (0x1u<<7)
#define ADC1_ISR_JEOS_B_0X0                 (0x0u<<6)
#define ADC1_ISR_JEOS_B_0X1                 (0x1u<<6)
#define ADC1_ISR_JEOC_B_0X0                 (0x0u<<5)
#define ADC1_ISR_JEOC_B_0X1                 (0x1u<<5)
#define ADC1_ISR_OVR_B_0X0                  (0x0u<<4)
#define ADC1_ISR_OVR_B_0X1                  (0x1u<<4)
#define ADC1_ISR_EOS_B_0X0                  (0x0u<<3)
#define ADC1_ISR_EOS_B_0X1                  (0x1u<<3)
#define ADC1_ISR_EOC_B_0X0                  (0x0u<<2)
#define ADC1_ISR_EOC_B_0X1                  (0x1u<<2)
#define ADC1_ISR_EOSMP_B_0X0                (0x0u<<1)
#define ADC1_ISR_EOSMP_B_0X1                (0x1u<<1)
#define ADC1_ISR_ADRDY_B_0X0                (0x0u<<0)
#define ADC1_ISR_ADRDY_B_0X1                (0x1u<<0)

// IER Configuration

#define ADC1_IER_LDORDYIE                   (0x1u<<12)
#define ADC1_IER_JQOVFIE                    (0x1u<<10)
#define ADC1_IER_AWD3IE                     (0x1u<<9)
#define ADC1_IER_AWD2IE                     (0x1u<<8)
#define ADC1_IER_AWD1IE                     (0x1u<<7)
#define ADC1_IER_JEOSIE                     (0x1u<<6)
#define ADC1_IER_JEOCIE                     (0x1u<<5)
#define ADC1_IER_OVRIE                      (0x1u<<4)
#define ADC1_IER_EOSIE                      (0x1u<<3)
#define ADC1_IER_EOCIE                      (0x1u<<2)
#define ADC1_IER_EOSMPIE                    (0x1u<<1)
#define ADC1_IER_ADRDYIE                    (0x1u<<0)

#define ADC1_IER_LDORDYIE_B_0X0             (0x0u<<12)
#define ADC1_IER_LDORDYIE_B_0X1             (0x1u<<12)
#define ADC1_IER_JQOVFIE_B_0X0              (0x0u<<10)
#define ADC1_IER_JQOVFIE_B_0X1              (0x1u<<10)
#define ADC1_IER_AWD3IE_B_0X0               (0x0u<<9)
#define ADC1_IER_AWD3IE_B_0X1               (0x1u<<9)
#define ADC1_IER_AWD2IE_B_0X0               (0x0u<<8)
#define ADC1_IER_AWD2IE_B_0X1               (0x1u<<8)
#define ADC1_IER_AWD1IE_B_0X0               (0x0u<<7)
#define ADC1_IER_AWD1IE_B_0X1               (0x1u<<7)
#define ADC1_IER_JEOSIE_B_0X0               (0x0u<<6)
#define ADC1_IER_JEOSIE_B_0X1               (0x1u<<6)
#define ADC1_IER_JEOCIE_B_0X0               (0x0u<<5)
#define ADC1_IER_JEOCIE_B_0X1               (0x1u<<5)
#define ADC1_IER_OVRIE_B_0X0                (0x0u<<4)
#define ADC1_IER_OVRIE_B_0X1                (0x1u<<4)
#define ADC1_IER_EOSIE_B_0X0                (0x0u<<3)
#define ADC1_IER_EOSIE_B_0X1                (0x1u<<3)
#define ADC1_IER_EOCIE_B_0X0                (0x0u<<2)
#define ADC1_IER_EOCIE_B_0X1                (0x1u<<2)
#define ADC1_IER_EOSMPIE_B_0X0              (0x0u<<1)
#define ADC1_IER_EOSMPIE_B_0X1              (0x1u<<1)
#define ADC1_IER_ADRDYIE_B_0X0              (0x0u<<0)
#define ADC1_IER_ADRDYIE_B_0X1              (0x1u<<0)

// CR Configuration

#define ADC1_CR_ADCAL                       (0x1u<<31)
#define ADC1_CR_ADCALDIF                    (0x1u<<30)
#define ADC1_CR_DEEPPWD                     (0x1u<<29)
#define ADC1_CR_ADVREGEN                    (0x1u<<28)
#define ADC1_CR_JADSTP                      (0x1u<<5)
#define ADC1_CR_ADSTP                       (0x1u<<4)
#define ADC1_CR_JADSTART                    (0x1u<<3)
#define ADC1_CR_ADSTART                     (0x1u<<2)
#define ADC1_CR_ADDIS                       (0x1u<<1)
#define ADC1_CR_ADEN                        (0x1u<<0)

#define ADC1_CR_ADCAL_B_0X0                 (0x0u<<31)
#define ADC1_CR_ADCAL_B_0X1                 (0x1u<<31)
#define ADC1_CR_ADCALDIF_B_0X0              (0x0u<<30)
#define ADC1_CR_ADCALDIF_B_0X1              (0x1u<<30)
#define ADC1_CR_DEEPPWD_B_0X0               (0x0u<<29)
#define ADC1_CR_DEEPPWD_B_0X1               (0x1u<<29)
#define ADC1_CR_ADVREGEN_B_0X0              (0x0u<<28)
#define ADC1_CR_ADVREGEN_B_0X1              (0x1u<<28)
#define ADC1_CR_JADSTP_B_0X0                (0x0u<<5)
#define ADC1_CR_JADSTP_B_0X1                (0x1u<<5)
#define ADC1_CR_ADSTP_B_0X0                 (0x0u<<4)
#define ADC1_CR_ADSTP_B_0X1                 (0x1u<<4)
#define ADC1_CR_JADSTART_B_0X0              (0x0u<<3)
#define ADC1_CR_JADSTART_B_0X1              (0x1u<<3)
#define ADC1_CR_ADSTART_B_0X0               (0x0u<<2)
#define ADC1_CR_ADSTART_B_0X1               (0x1u<<2)
#define ADC1_CR_ADDIS_B_0X0                 (0x0u<<1)
#define ADC1_CR_ADDIS_B_0X1                 (0x1u<<1)
#define ADC1_CR_ADEN_B_0X0                  (0x0u<<0)
#define ADC1_CR_ADEN_B_0X1                  (0x1u<<0)

// CFGR1 Configuration

