Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_adc1.h
#define ADC1_SMPR1_SMP9_B_0X0               (0x0u<<27)
#define ADC1_SMPR1_SMP9_B_0X1               (0x1u<<27)
#define ADC1_SMPR1_SMP9_B_0X2               (0x2u<<27)
#define ADC1_SMPR1_SMP9_B_0X3               (0x3u<<27)
#define ADC1_SMPR1_SMP9_B_0X4               (0x4u<<27)
#define ADC1_SMPR1_SMP9_B_0X5               (0x5u<<27)
#define ADC1_SMPR1_SMP9_B_0X6               (0x6u<<27)
#define ADC1_SMPR1_SMP9_B_0X7               (0x7u<<27)
#define ADC1_SMPR1_SMP8_B_0X0               (0x0u<<24)
#define ADC1_SMPR1_SMP8_B_0X1               (0x1u<<24)
#define ADC1_SMPR1_SMP8_B_0X2               (0x2u<<24)
#define ADC1_SMPR1_SMP8_B_0X3               (0x3u<<24)
#define ADC1_SMPR1_SMP8_B_0X4               (0x4u<<24)
#define ADC1_SMPR1_SMP8_B_0X5               (0x5u<<24)
#define ADC1_SMPR1_SMP8_B_0X6               (0x6u<<24)
#define ADC1_SMPR1_SMP8_B_0X7               (0x7u<<24)
#define ADC1_SMPR1_SMP7_B_0X0               (0x0u<<21)
#define ADC1_SMPR1_SMP7_B_0X1               (0x1u<<21)
#define ADC1_SMPR1_SMP7_B_0X2               (0x2u<<21)
#define ADC1_SMPR1_SMP7_B_0X3               (0x3u<<21)
#define ADC1_SMPR1_SMP7_B_0X4               (0x4u<<21)
#define ADC1_SMPR1_SMP7_B_0X5               (0x5u<<21)
#define ADC1_SMPR1_SMP7_B_0X6               (0x6u<<21)
#define ADC1_SMPR1_SMP7_B_0X7               (0x7u<<21)
#define ADC1_SMPR1_SMP6_B_0X0               (0x0u<<18)
#define ADC1_SMPR1_SMP6_B_0X1               (0x1u<<18)
#define ADC1_SMPR1_SMP6_B_0X2               (0x2u<<18)
#define ADC1_SMPR1_SMP6_B_0X3               (0x3u<<18)
#define ADC1_SMPR1_SMP6_B_0X4               (0x4u<<18)
#define ADC1_SMPR1_SMP6_B_0X5               (0x5u<<18)
#define ADC1_SMPR1_SMP6_B_0X6               (0x6u<<18)
#define ADC1_SMPR1_SMP6_B_0X7               (0x7u<<18)
#define ADC1_SMPR1_SMP5_B_0X0               (0x0u<<15)
#define ADC1_SMPR1_SMP5_B_0X1               (0x1u<<15)
#define ADC1_SMPR1_SMP5_B_0X2               (0x2u<<15)
#define ADC1_SMPR1_SMP5_B_0X3               (0x3u<<15)
#define ADC1_SMPR1_SMP5_B_0X4               (0x4u<<15)
#define ADC1_SMPR1_SMP5_B_0X5               (0x5u<<15)
#define ADC1_SMPR1_SMP5_B_0X6               (0x6u<<15)
#define ADC1_SMPR1_SMP5_B_0X7               (0x7u<<15)
#define ADC1_SMPR1_SMP4_B_0X0               (0x0u<<12)
#define ADC1_SMPR1_SMP4_B_0X1               (0x1u<<12)
#define ADC1_SMPR1_SMP4_B_0X2               (0x2u<<12)
#define ADC1_SMPR1_SMP4_B_0X3               (0x3u<<12)
#define ADC1_SMPR1_SMP4_B_0X4               (0x4u<<12)
#define ADC1_SMPR1_SMP4_B_0X5               (0x5u<<12)
#define ADC1_SMPR1_SMP4_B_0X6               (0x6u<<12)
#define ADC1_SMPR1_SMP4_B_0X7               (0x7u<<12)
#define ADC1_SMPR1_SMP3_B_0X0               (0x0u<<9)
#define ADC1_SMPR1_SMP3_B_0X1               (0x1u<<9)
#define ADC1_SMPR1_SMP3_B_0X2               (0x2u<<9)
#define ADC1_SMPR1_SMP3_B_0X3               (0x3u<<9)
#define ADC1_SMPR1_SMP3_B_0X4               (0x4u<<9)
#define ADC1_SMPR1_SMP3_B_0X5               (0x5u<<9)
#define ADC1_SMPR1_SMP3_B_0X6               (0x6u<<9)
#define ADC1_SMPR1_SMP3_B_0X7               (0x7u<<9)
#define ADC1_SMPR1_SMP2_B_0X0               (0x0u<<6)
#define ADC1_SMPR1_SMP2_B_0X1               (0x1u<<6)
#define ADC1_SMPR1_SMP2_B_0X2               (0x2u<<6)
#define ADC1_SMPR1_SMP2_B_0X3               (0x3u<<6)
#define ADC1_SMPR1_SMP2_B_0X4               (0x4u<<6)
#define ADC1_SMPR1_SMP2_B_0X5               (0x5u<<6)
#define ADC1_SMPR1_SMP2_B_0X6               (0x6u<<6)
#define ADC1_SMPR1_SMP2_B_0X7               (0x7u<<6)
#define ADC1_SMPR1_SMP1_B_0X0               (0x0u<<3)
#define ADC1_SMPR1_SMP1_B_0X1               (0x1u<<3)
#define ADC1_SMPR1_SMP1_B_0X2               (0x2u<<3)
#define ADC1_SMPR1_SMP1_B_0X3               (0x3u<<3)
#define ADC1_SMPR1_SMP1_B_0X4               (0x4u<<3)
#define ADC1_SMPR1_SMP1_B_0X5               (0x5u<<3)
#define ADC1_SMPR1_SMP1_B_0X6               (0x6u<<3)
#define ADC1_SMPR1_SMP1_B_0X7               (0x7u<<3)
#define ADC1_SMPR1_SMP0_B_0X0               (0x0u<<0)
#define ADC1_SMPR1_SMP0_B_0X1               (0x1u<<0)
#define ADC1_SMPR1_SMP0_B_0X2               (0x2u<<0)
#define ADC1_SMPR1_SMP0_B_0X3               (0x3u<<0)
#define ADC1_SMPR1_SMP0_B_0X4               (0x4u<<0)
#define ADC1_SMPR1_SMP0_B_0X5               (0x5u<<0)
#define ADC1_SMPR1_SMP0_B_0X6               (0x6u<<0)
#define ADC1_SMPR1_SMP0_B_0X7               (0x7u<<0)

// SMPR2 Configuration

#define ADC1_SMPR2_SMP19                    (0x7u<<27)
#define ADC1_SMPR2_SMP19_0                  (0x1u<<27)
#define ADC1_SMPR2_SMP18                    (0x7u<<24)
#define ADC1_SMPR2_SMP18_0                  (0x1u<<24)
#define ADC1_SMPR2_SMP17                    (0x7u<<21)
#define ADC1_SMPR2_SMP17_0                  (0x1u<<21)
#define ADC1_SMPR2_SMP16                    (0x7u<<18)
#define ADC1_SMPR2_SMP16_0                  (0x1u<<18)
#define ADC1_SMPR2_SMP15                    (0x7u<<15)
#define ADC1_SMPR2_SMP15_0                  (0x1u<<15)
#define ADC1_SMPR2_SMP14                    (0x7u<<12)
#define ADC1_SMPR2_SMP14_0                  (0x1u<<12)
#define ADC1_SMPR2_SMP13                    (0x7u<<9)
#define ADC1_SMPR2_SMP13_0                  (0x1u<<9)
#define ADC1_SMPR2_SMP12                    (0x7u<<6)
#define ADC1_SMPR2_SMP12_0                  (0x1u<<6)
#define ADC1_SMPR2_SMP11                    (0x7u<<3)
#define ADC1_SMPR2_SMP11_0                  (0x1u<<3)
#define ADC1_SMPR2_SMP10                    (0x7u<<0)
#define ADC1_SMPR2_SMP10_0                  (0x1u<<0)

#define ADC1_SMPR2_SMP19_B_0X0              (0x0u<<27)
#define ADC1_SMPR2_SMP19_B_0X1              (0x1u<<27)
#define ADC1_SMPR2_SMP19_B_0X2              (0x2u<<27)
#define ADC1_SMPR2_SMP19_B_0X3              (0x3u<<27)
#define ADC1_SMPR2_SMP19_B_0X4              (0x4u<<27)
#define ADC1_SMPR2_SMP19_B_0X5              (0x5u<<27)
#define ADC1_SMPR2_SMP19_B_0X6              (0x6u<<27)
#define ADC1_SMPR2_SMP19_B_0X7              (0x7u<<27)
#define ADC1_SMPR2_SMP18_B_0X0              (0x0u<<24)
#define ADC1_SMPR2_SMP18_B_0X1              (0x1u<<24)
#define ADC1_SMPR2_SMP18_B_0X2              (0x2u<<24)
#define ADC1_SMPR2_SMP18_B_0X3              (0x3u<<24)
#define ADC1_SMPR2_SMP18_B_0X4              (0x4u<<24)
#define ADC1_SMPR2_SMP18_B_0X5              (0x5u<<24)
#define ADC1_SMPR2_SMP18_B_0X6              (0x6u<<24)
#define ADC1_SMPR2_SMP18_B_0X7              (0x7u<<24)
#define ADC1_SMPR2_SMP17_B_0X0              (0x0u<<21)
#define ADC1_SMPR2_SMP17_B_0X1              (0x1u<<21)
#define ADC1_SMPR2_SMP17_B_0X2              (0x2u<<21)
#define ADC1_SMPR2_SMP17_B_0X3              (0x3u<<21)
#define ADC1_SMPR2_SMP17_B_0X4              (0x4u<<21)
#define ADC1_SMPR2_SMP17_B_0X5              (0x5u<<21)
#define ADC1_SMPR2_SMP17_B_0X6              (0x6u<<21)
#define ADC1_SMPR2_SMP17_B_0X7              (0x7u<<21)
#define ADC1_SMPR2_SMP16_B_0X0              (0x0u<<18)
#define ADC1_SMPR2_SMP16_B_0X1              (0x1u<<18)
#define ADC1_SMPR2_SMP16_B_0X2              (0x2u<<18)
#define ADC1_SMPR2_SMP16_B_0X3              (0x3u<<18)
#define ADC1_SMPR2_SMP16_B_0X4              (0x4u<<18)
#define ADC1_SMPR2_SMP16_B_0X5              (0x5u<<18)
#define ADC1_SMPR2_SMP16_B_0X6              (0x6u<<18)
#define ADC1_SMPR2_SMP16_B_0X7              (0x7u<<18)
#define ADC1_SMPR2_SMP15_B_0X0              (0x0u<<15)
#define ADC1_SMPR2_SMP15_B_0X1              (0x1u<<15)
#define ADC1_SMPR2_SMP15_B_0X2              (0x2u<<15)
#define ADC1_SMPR2_SMP15_B_0X3              (0x3u<<15)
#define ADC1_SMPR2_SMP15_B_0X4              (0x4u<<15)
#define ADC1_SMPR2_SMP15_B_0X5              (0x5u<<15)
#define ADC1_SMPR2_SMP15_B_0X6              (0x6u<<15)
#define ADC1_SMPR2_SMP15_B_0X7              (0x7u<<15)
#define ADC1_SMPR2_SMP14_B_0X0              (0x0u<<12)
#define ADC1_SMPR2_SMP14_B_0X1              (0x1u<<12)
#define ADC1_SMPR2_SMP14_B_0X2              (0x2u<<12)
#define ADC1_SMPR2_SMP14_B_0X3              (0x3u<<12)
#define ADC1_SMPR2_SMP14_B_0X4              (0x4u<<12)
#define ADC1_SMPR2_SMP14_B_0X5              (0x5u<<12)
#define ADC1_SMPR2_SMP14_B_0X6              (0x6u<<12)
#define ADC1_SMPR2_SMP14_B_0X7              (0x7u<<12)
#define ADC1_SMPR2_SMP13_B_0X0              (0x0u<<9)
#define ADC1_SMPR2_SMP13_B_0X1              (0x1u<<9)
#define ADC1_SMPR2_SMP13_B_0X2              (0x2u<<9)
#define ADC1_SMPR2_SMP13_B_0X3              (0x3u<<9)
#define ADC1_SMPR2_SMP13_B_0X4              (0x4u<<9)
#define ADC1_SMPR2_SMP13_B_0X5              (0x5u<<9)
#define ADC1_SMPR2_SMP13_B_0X6              (0x6u<<9)
#define ADC1_SMPR2_SMP13_B_0X7              (0x7u<<9)
#define ADC1_SMPR2_SMP12_B_0X0              (0x0u<<6)
#define ADC1_SMPR2_SMP12_B_0X1              (0x1u<<6)
#define ADC1_SMPR2_SMP12_B_0X2              (0x2u<<6)
#define ADC1_SMPR2_SMP12_B_0X3              (0x3u<<6)
#define ADC1_SMPR2_SMP12_B_0X4              (0x4u<<6)
#define ADC1_SMPR2_SMP12_B_0X5              (0x5u<<6)
#define ADC1_SMPR2_SMP12_B_0X6              (0x6u<<6)
#define ADC1_SMPR2_SMP12_B_0X7              (0x7u<<6)
#define ADC1_SMPR2_SMP11_B_0X0              (0x0u<<3)
#define ADC1_SMPR2_SMP11_B_0X1              (0x1u<<3)
#define ADC1_SMPR2_SMP11_B_0X2              (0x2u<<3)
#define ADC1_SMPR2_SMP11_B_0X3              (0x3u<<3)
#define ADC1_SMPR2_SMP11_B_0X4              (0x4u<<3)
#define ADC1_SMPR2_SMP11_B_0X5              (0x5u<<3)
#define ADC1_SMPR2_SMP11_B_0X6              (0x6u<<3)
#define ADC1_SMPR2_SMP11_B_0X7              (0x7u<<3)
#define ADC1_SMPR2_SMP10_B_0X0              (0x0u<<0)
#define ADC1_SMPR2_SMP10_B_0X1              (0x1u<<0)
#define ADC1_SMPR2_SMP10_B_0X2              (0x2u<<0)
#define ADC1_SMPR2_SMP10_B_0X3              (0x3u<<0)
#define ADC1_SMPR2_SMP10_B_0X4              (0x4u<<0)
#define ADC1_SMPR2_SMP10_B_0X5              (0x5u<<0)
#define ADC1_SMPR2_SMP10_B_0X6              (0x6u<<0)
#define ADC1_SMPR2_SMP10_B_0X7              (0x7u<<0)

// PCSEL Configuration

#define ADC1_PCSEL_PCSEL                    (0xFFFFFu<<0)
#define ADC1_PCSEL_PCSEL_0                  (0x1u<<0)

